"""1) Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран."""

a = 3
b = 2
c = 1
print(f"{a}...")
print(f"{b}...")
print(f"{c}...")

print("Поиграем? :)")

x = int(input("Пожалуйста, введите целое число: "))
y = input("Представтесь, пожалуйста: ")
z = int(input("Введите еще одно целое число: "))
k = input("Введите имя Вашего друга: ")

print(f"Привет, {y}!")
print(f"У тебя {x} друзей :)")
print(f"Тебе нужно {z} тыщ деняк :)")
print(f"{k} тебя уважает :)")
print("Я предсказатель, а тебя ждёт успех!!!")
